//****************************************
//	light.h
//	Author:大殿慶輔
//****************************************
#ifndef _LIGHT_H_
#define _LIGHT_H_

#include"main.h"
//****************************************
// 構造体の定義
//****************************************
// 光の情報
typedef struct
{
	// 位置関連
	D3DXVECTOR3	rot;	// 向き
	D3DXCOLOR	col;	// 色
}Light;
//****************************************
// マクロ定義
//****************************************
#define NUM_LIGHT			(3)		//ライトの数
#define LIGHT_CLOR			(0.9f)	//全体のライト色
//****************************************
//プロトタイプ宣言
//****************************************
void InitLight(void);
void UninitLight(void);
void UpdateLight(void);
#endif