//========================================
// 
// 値の処理のまとまり
// Author:西村 吏功
// 
//========================================
// *** chunk.cpp ***
//========================================
#include "main.h"
#include "chunk.h"

//================================================================================
//----------|---------------------------------------------------------------------
//==========| hファイルの共有関数
//----------|---------------------------------------------------------------------
//================================================================================

//========================================
// FloatControl関数 - float型の値の制御処理 -
//========================================
void FloatControl(float *fData, float fMax, float fMin)
{
	if (*fData > fMax)
	{// 最大値を上回っていた時、
		// 最大値を代入
		*fData = fMax;
	}
	else if (*fData < fMin)
	{// 最小値を下回っていた時、
		// 最小値を代入
		*fData = fMin;
	}
}

//========================================
// FloatLoopControl関数 - float型の値のループ制御処理 -
//========================================
void FloatLoopControl(float *fData, float fMax, float fMin)
{
	if (*fData > fMax)
	{// 最大値を上回っていた時、
		// 最小値を代入
		*fData = fMin;
	}
	else if (*fData < fMin)
	{// 最小値を下回っていた時、
		// 最大値を代入
		*fData = fMax;
	}
}

//========================================
// IntControl関数 - int型の値の制御処理 -
//========================================
void IntControl(int *fData, int fMax, int fMin)
{
	if (*fData > fMax)
	{// 最大値を上回っていた時、
		// 最大値を代入
		*fData = fMax;
	}
	else if (*fData < fMin)
	{// 最小値を下回っていた時、
		// 最小値を代入
		*fData = fMin;
	}
}

//========================================
// IntLoopControl関数 - int型の値のループ制御処理 -
//========================================
void IntLoopControl(int *fData, int fMax, int fMin)
{
	if (*fData > fMax)
	{// 最大値を上回っていた時、
		// 最小値を代入
		*fData = fMin;
	}
	else if (*fData < fMin)
	{// 最小値を下回っていた時、
		// 最大値を代入
		*fData = fMax;
	}
}