//========================================
// 
// 背景の処理
// Author:RIKU NISHIMURA
// 
//========================================
// *** back-ground.cpp ***
//========================================
#include "main.h"
#include "back-ground.h"
#include "bg_game_00.h"		// BG:ゲーム		[00]
#include "bg_result_00.h"	// BG:リザルト		[00]
#include "bg_result_01.h"	// BG:リザルト		[01]
#include "bg_title_00.h"	// BG:タイトル		[00]
#include "bg_tutorial_00.h"	// BG:チュートリアル[00]

//================================================================================
//----------|---------------------------------------------------------------------
//==========| hファイルの共有関数
//----------|---------------------------------------------------------------------
//================================================================================

//========================================
// LoadBackGround関数 - 背景の読み込み処理 -
// Author:RIKU NISHIMURA
//========================================
void LoadBackGround(void)
{
	LoadBg_game_00();		// BG:ゲーム		[00]
	LoadBg_result_00();		// BG:リザルト		[00]
	LoadBg_result_01();		// BG:リザルト		[01]
	LoadBg_title_00();		// BG:タイトル		[00]
	LoadBg_tutorial_00();	// BG:チュートリアル[00]
}